describe('데이터 파일 테스트', () => {
    it('csv 파일 불러오기', () => {
        // csv 파일 불러오기 함수
        // csv 데이터 구조 검증
        expect(3 + 4).toBe(7);
    });

    it('필요없는 데이터 삭제', () => {
        //csv 데이터 리스트 선언
        //거래유형, 상세내용 기준으로 데이터 삭제하는 함수
        //필터가 되었는지 리스트 확인

        const name = 'yuds';
        expect(name).toBe('yuds');
    });

    describe('사이트에서 사용하는 데이터로 변환', () => {
        //csv 데이터 리스트 선언

        it('총 투입 금액 검증',()=>{
            //총 투입 금액 변환 함수
        });

        it('현 주식 비율 검증',()=>{
            //현 주식 비율 변환 함수
        });

        it('총 순이익 검증',()=>{
            //총 순이익 변환 함수
        });

        it('총 투입 금액 검증',()=>{
            //총 투입 금액 변환 함수
        });

        it('최초 구매 시기 검증',()=>{
            //최초 구매 시기 변환 함수
        });

        it('매수량 검증',()=>{
            //매수량 변환 함수
        });

        it('보유기간 검증',()=>{
            //보유기간 변환 함수
        });

        it('평단가 검증',()=>{
            //평단가 변환 함수
        });

        it('평균 배당금 검증',()=>{
            //평균 배당금 변환 함수
        });

        it('주식 내역 검증',()=>{
            //주식 내역 변환 함수
        });

        const name = 'yuds';
        expect(name).toBe('yuds');
    });

    it('모든 csv 데이터 합치기', () => {
        //csv 2개 이상의 파일 데이터 선언
        //데이터 합치기
        //데이터 주식이름을 기준으로 사용하는 데이터 형태로 만들기
        //데이터 구조 검증
    });

});